Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: You can customize the image names used for service discovery by setting the appropriate properties in your `application.properties` file. For example, to use a custom Kafka image:
ja_jp: サービスディスカバリーに使用されるイメージ名を、`application.properties` ファイルで適切なプロパティーを設定することでカスタマイズできます。例えば、カスタム Kafka イメージを使用するには:

source: You can customize the key and content encryption algorithms by using the `JwtEncryptionBuilder` API. For example:
ja_jp: `JwtEncryptionBuilder` API を使用して、キーとコンテンツの暗号化アルゴリズムをカスタマイズできます。例:

source: You can customize the key and content encryption algorithms, for example:
ja_jp: キーとコンテンツの暗号化アルゴリズムはカスタマイズできます。以下はその例です。

source: You can customize the name of the claim to use for the roles with the `quarkus.oauth2.role-claim` property.
ja_jp: ロールに使用するクレームの名前は、 `quarkus.oauth2.role-claim` プロパティーでカスタマイズできます。

source: You can customize the signature algorithm, for example:
ja_jp: 署名アルゴリズムはカスタマイズできます。以下はその例です。

source: You can customize the underlying client configuration by producing an instance of `AmqpClientOptions` as follows:
ja_jp: 次のように `AmqpClientOptions` のインスタンスを生成することにより、基盤となるクライアント設定をカスタマイズできます。

source: You can customize the underlying client configuration by producing an instance of `RabbitMQOptions` as follows:
ja_jp: 次のように `RabbitMQOptions` のインスタンスを生成することにより、基盤となるクライアント設定をカスタマイズできます。

source: You can declare URI parameters and use regular expressions in your path, so for instance the following endpoint will serve requests for `/hello/stef/23` and `/hello` but not `/hello/stef/0x23`:
ja_jp: URI パラメーターを宣言し、パスで正規表現を使用できるため、たとえば、次のエンドポイントは `/hello/stef/23` と `/hello` のリクエストを処理しますが、 `/hello/stef/0x23` は処理しません。

source: You can declare functions that are invoked in the following phases of the request processing:
ja_jp: リクエスト処理の次のフェーズで呼び出される関数を宣言できます。

source: You can declare functions which are invoked in the following phases of the request processing:
ja_jp: リクエスト処理の次のフェーズで呼び出される関数を宣言できます。

source: You can declare your constraint validators as CDI beans:
ja_jp: 制約バリデーターをCDI Beanとして宣言することができます。

source: You can define a default proxy configuration that will be used by all REST Clients that do not explicitly reference a named proxy configuration.
ja_jp: 明示的に名前付きプロキシー設定を参照しないすべての REST Client で使用されるデフォルトのプロキシー設定を定義できます。

source: You can define a link:https://www.rfc-editor.org/rfc/rfc9449.html#name-resource-server-provided-no[custom DPoP nonce provider] by implementing the `io.quarkus.oidc.DPoPNonceProvider` interface as a CDI bean. If the DPoP proof nonce is missing or invalid, Quarkus responds with the `401 Unauthorized` status and attaches the expected nonce as the `DPoP-Nonce` header value.
ja_jp: link:https://www.rfc-editor.org/rfc/rfc9449.html#name-resource-server-provided-no[カスタム DPoP nonce プロバイダー] は、`io.quarkus.oidc.DPoPNonceProvider` インターフェースを CDI Bean として実装することで定義できます。 DPoP プルーフ nonce が不足しているか無効な場合、Quarkus は `401 Unauthorized` ステータスで応答し、期待される nonce を `DPoP-Nonce` ヘッダー値として添付します。

source: You can define a type-safe mail template in your Java code. Just annotate a class with `@io.quarkus.qute.CheckedTemplate` and all its `static native` methods that return `MailTemplate` will be used to define type-safe mail templates and the list of parameters they require:
ja_jp: Javaコードでタイプセーフ・メール・テンプレートを定義することができます。 クラスを `@io.quarkus.qute.CheckedTemplate` でアノテートするだけで、 `MailTemplate` を返す `static native` メソッドすべてが、型安全なメール・テンプレートと、それらが必要とするパラメータのリストを定義するために使われます：

source: You can define beans that live for as long as a transaction, and through CDI lifecycle events perform actions when a transaction starts and ends.
ja_jp: トランザクションと同じ期間だけ有効なBeanを定義し、CDIライフサイクルイベントを通じて、トランザクションの開始と終了時にアクションを実行することができます。

source: You can define multiple persistence units and datasources, and they can mix blocking and reactive datasources. To ensure that a datasource supports reactive, you need to set the `reactive` property to `true`.
ja_jp: 複数の永続化ユニットとデータソースを定義でき、それらはブロッキングと Reactive のデータソースを混在させることができます。データソースが Reactive をサポートしていることを確認するには、`reactive` プロパティーを `true` に設定する必要があります。

source: You can define multiple tenants in your configuration file, just make sure they have a unique alias so that you can map them properly when resolving a tenant from your `TenantResolver` implementation.
ja_jp: 設定ファイルで複数のテナントを定義できます。 `TenantResolver` 実装からテナントを解決するときに適切にマップできるように、それらに一意のエイリアスがあることを確認してください。

source: You can define multiple tenants in your configuration file. To map them correctly when resolving a tenant from your `TenantResolver` implementation, ensure each has a unique alias.
ja_jp: 設定ファイルで複数のテナントを定義できます。 `TenantResolver` 実装からテナントを解決するときにそれらを正しくマップするには、それぞれに一意のエイリアスがあることを確認します。

source: You can define named proxy configurations and have specific REST Clients use them.
ja_jp: 名前付きプロキシー設定を定義し、特定の REST Client でそれらを使用させることができます。

source: You can define role-based policies that allow users with specific roles to access the resources.
ja_jp: 特定のロールを持つユーザーにリソースへのアクセスを許可するロールベースのポリシーを定義できます。

source: You can define role-based policies that allow users with specified roles to access the resources.
ja_jp: 指定したロールを持つユーザーにリソースへのアクセスを許可するロールベースのポリシーを定義することができます。

source: You can define the `imagePullPolicy` for this particular init container with:
ja_jp: この特定のinitコンテナに対して `imagePullPolicy` を定義できます：

source: You can define the logic to skip any execution of a scheduled method via `@Scheduled#skipExecutionIf()`. The specified bean class must implement `io.quarkus.scheduler.Scheduled.SkipPredicate` and the execution is skipped if the result of the `test()` method is `true`.
ja_jp: `@Scheduled#skipExecutionIf()` を通じて、スケジュールされたメソッドの実行をスキップするロジックを定義することができます。指定されたBeanクラスは、 `io.quarkus.scheduler.Scheduled.SkipPredicate` を実装する必要があり、 `test()` メソッドの結果が `true` である場合に実行がスキップされます。

source: You can define the logic to skip any execution of a scheduled method via `@Scheduled#skipExecutionIf()`. The specified class must implement `io.quarkus.scheduler.Scheduled.SkipPredicate` and the execution is skipped if the result of the `test()` method is `true`. The class must either represent a CDI bean or declare a public no-args constructor. In case of CDI, there must be exactly one bean that has the specified class in its set of bean types, otherwise the build fails. Furthermore, the scope of the bean must be active during execution of the job. If the scope is `@Dependent` then the bean instance belongs exclusively to the specific scheduled method and is destroyed when the application is shut down.
ja_jp: `@Scheduled#skipExecutionIf()` を使用して、スケジュールされたメソッドの実行をスキップするロジックを定義できます。 指定されたクラスは `io.quarkus.scheduler.Scheduled.SkipPredicate` を実装する必要があり、 `test()` メソッドの結果が `true` の場合、実行はスキップされます。 クラスは CDI Bean を表すか、引数なしのパブリックコンストラクターを宣言する必要があります。 CDI の場合、Bean タイプのセット内に指定されたクラスを持つ Bean が 1 つだけ存在する必要があります。そうでない場合、ビルドは失敗します。 さらに、ジョブの実行中は Bean のスコープがアクティブである必要があります。 スコープが `@Dependent` の場合、Bean インスタンスは特定のスケジュールメソッドだけに属し、アプリケーションがシャットダウンされると破棄されます。

source: You can define type-safe templates in your Java code. Parameters of type-safe templates are automatically turned into _parameter declarations_ that are used to bind <<typesafe_expressions>>. The type-safe expressions are then validated at build time.
ja_jp: Java コードでタイプセーフなテンプレートを定義できます。 タイプセーフなテンプレートのパラメーターは、<<typesafe_expressions>> のバインドに使用される _パラメーター宣言_ に自動変換されます。 その後、タイプセーフな式はビルド時に検証されます。

source: You can define your entity as regular POJO. You can add the `@MongoEntity` annotation to your entity if you need to customize the name of the collection, the database, or the client.
ja_jp: エンティティは通常のPOJOとして定義することができます。コレクション、データベース、またはクライアントの名前をカスタマイズする必要がある場合は、 `@MongoEntity` アノテーションをエンティティに追加できます。

source: You can define your transaction boundaries either declaratively with `@Transactional` or programmatically with `QuarkusTransaction`. You can also use the JTA `UserTransaction` API directly, however this is less user-friendly than `QuarkusTransaction`.
ja_jp: トランザクションの境界は、 `@Transactional` で宣言的に、または `QuarkusTransaction` でプログラム的に定義できます。 JTA `UserTransaction` API を直接使用することもできますが、これは `QuarkusTransaction` よりも使い勝手が悪くなります。

source: You can define your transaction boundaries the easy way, or the less easy way :)
ja_jp: トランザクションの境界を定義するには、簡単な方法と比較的簡単ではない方法があります :)

source: You can deploy _verticles_ in Quarkus. It supports:
ja_jp: Quarkusで _verticles_ をデプロイすることができます。次をサポートしています:

source: You can deploy your Lambda as a pure Java jar, or you can compile your project to a native image and deploy that for a smaller memory footprint and startup time. Our integration also generates SAM deployment files that can be consumed by https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/what-is-sam.html[Amazon's SAM framework].
ja_jp: Lambda を純粋な Java jar としてデプロイすることもできますし、プロジェクトをネイティブイメージにコンパイルしてデプロイすることで、より少ないメモリーフットプリントと起動時間を実現することもできます。また、統合により、 https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/what-is-sam.html[AmazonのSAM framework] で使用できるSAMデプロイメントファイルも生成されます。

source: You can deploy your native {project-name} applications to {openshift} compiled to native executables by using the Docker build strategy.
ja_jp: Docker ビルド戦略を使用して、ネイティブ実行可能ファイルにコンパイルされたネイティブ {project-name} アプリケーションを {openshift} にデプロイできます。

source: You can deploy your {project-name} applications to {openshift-long} by using the Source-to-Image (S2I) method. With S2I, you must provide the source code to the build container through a Git repository or by uploading the source code at build time.
ja_jp: {project-name} のアプリケーションを {openshift-long} にデプロイするには、Source-to-Image (S2I) メソッドを使用します。S2Iでは、Gitリポジトリを通して、あるいはビルド時にソースコードをアップロードして、ビルドコンテナにソースコードを提供する必要があります。

source: You can deploy {project-name} applications that run Java {jdk-version-latest} to {openshift} by using the S2I method.
ja_jp: Java {jdk-version-latest} を実行する {project-name} アプリケーションを {openshift} にデプロイするには、S2Iメソッドを使用します。

source: You can deploy {project-name} applications that run Java {jdk-version-other} to {openshift} by using the S2I method.
ja_jp: Java {jdk-version-other} を実行する {project-name} アプリケーションを {openshift} にデプロイするには、S2Iメソッドを使用します。

source: You can deploy {project-name} applications to {openshift} with Java {jdk-version-all} versions.
ja_jp: {project-name} アプリケーションを Java {jdk-version-all} で {openshift} にデプロイできます。

source: You can detect the vulnerabilities at the application build time with an NVD feed by using the Maven link:https://jeremylong.github.io/DependencyCheck/dependency-check-maven/[OWASP Dependency check plugin].
ja_jp: Maven link:https://jeremylong.github.io/DependencyCheck/dependency-check-maven/[OWASP Dependency checkプラグイン] を使用することで、NVDフィードを使用してアプリケーションビルド時に脆弱性を検出することができます。

source: You can detect the vulnerabilities at the application build time with an NVD feed by using the Maven link:https://jeremylong.github.io/DependencyCheck/dependency-check-maven/[OWASP Dependency-check-maven plugin].
ja_jp: Maven link:https://jeremylong.github.io/DependencyCheck/dependency-check-maven/[OWASP Dependency-check-mavenプラグイン] を使用することで、NVDフィードを使ってアプリケーションのビルド時に脆弱性を検出することができます。

source: You can directly use the HTTP parameters in your templates.
ja_jp: テンプレート内で HTTP パラメーターを直接使用できます。

source: You can disable automatic key generation by setting at least one of the following properties:
ja_jp: 以下のプロパティーの少なくとも 1 つを設定することで、自動キー生成を無効にできます。

source: You can disable extension health check via the property `quarkus.health.extensions.enabled` so none will be automatically registered.
ja_jp: エクステンションのヘルスチェックは、プロパティ（ `quarkus.health.extensions.enabled` ）で無効にすることができ、自動的に登録されることはありません。

source: You can disable extension health checks via the property `quarkus.health.extensions.enabled` so none will be automatically registered.
ja_jp: エクステンションのヘルスチェックは、プロパティ（ `quarkus.health.extensions.enabled` ）で無効にすることができ、自動的に登録されることはありません。

source: You can disable measurement of HTTP endpoints using the `quarkus.micrometer.binder.http-server.ignore-patterns` property. This property accepts a comma-separated list of simple regex match patterns identifying URI paths that should be ignored. For example, setting `quarkus.micrometer.binder.http-server.ignore-patterns=/example/prime/[0-9]+` will ignore a request to `http://localhost:8080/example/prime/7919`. A request to `http://localhost:8080/example/gauge/7919` would still be measured.
ja_jp: `quarkus.micrometer.binder.http-server.ignore-patterns` プロパティを使用して、HTTP エンドポイントの測定を無効にすることができます。このプロパティには、無視すべきURIパスを特定する単純な正規表現のマッチパターンをコンマで区切ったリストを指定できます。例えば、 `quarkus.micrometer.binder.http-server.ignore-patterns=/example/prime/[0-9]+` を設定すると、以下へのリクエストが無視されます。 `http://localhost:8080/example/prime/7919` へのリクエストは無視されます。 `http://localhost:8080/example/gauge/7919` へのリクエストは、依然として計測されます。

source: You can disable metadata discovery with `quarkus.oidc.discovery-enabled=false` when the provider does not support it (most OAuth2 providers do not), when you would like to optimize start up time by skipping a remote discovery call and configure individual OIDC provider endpoint URLs instead.
ja_jp: プロバイダーがメタデータ検出をサポートしていない場合 (ほとんどの OAuth2 プロバイダーはサポートしていません)、またはリモートのディスカバリー呼び出しをスキップして個別の OIDC プロバイダーエンドポイント URL を設定することで起動時間を最適化したい場合は、 `quarkus.oidc.discovery-enabled=false` でメタデータ検出を無効にできます。

source: You can disable the "Example Code" to avoid the generated project containing examples.
ja_jp: "Example Code" を無効にすることで、生成されたプロジェクトにサンプルコードが含まれないようにすることができます。

source: You can disable the "Example Code" to avoid the generated project to contain examples.
ja_jp: "Example Code"を無効にすることで、生成されたプロジェクトにサンプルコードが含まれないようにすることができます。

source: You can disable the RBAC resources generation using the property `quarkus.kubernetes-client.generate-rbac=false`.
ja_jp: プロパティー `quarkus.kubernetes-client.generate-rbac=false` を使用して、RBAC リソースの生成を無効にすることができます。

source: You can disable the automatic database start in `application.properties` via:
ja_jp: `application.properties` でデータベースの自動起動を無効にするには、以下を使用します。

source: You can disable the preloading of classes using:
ja_jp: 次の設定により、クラスのプリローディングを無効にすることができます。

source: You can disable this behavior by setting `quarkus.datasource.health.enabled=false`.
ja_jp: `quarkus.datasource.health.enabled=false` を設定することで、この動作を無効にできます。

source: You can disable this feature using:
ja_jp: 次の設定により、この機能を無効にすることができます。

source: You can disable this prompt by setting the `short-name-mode="disabled"` configuration property of Podman in `/etc/containers/registries.conf`.
ja_jp: このプロンプトを無効にするには、 `/etc/containers/registries.conf` の Podman の設定プロパティに `short-name-mode="disabled"` を設定します。

source: You can disable token encryption in the session cookie by setting `quarkus.oidc.token-state-manager.encryption-required=false`.
ja_jp: `quarkus.oidc.token-state-manager.encryption-required=false` を設定することで、セッションクッキーでのトークン暗号化を無効にすることができます。

source: You can disable tracing for a specific channel using the following configuration:
ja_jp: 次の設定を使用して、特定のチャネルのトレースを無効にすることができます。

source: You can distinguish between a root and a duplicated context using the following:
ja_jp: ルート・コンテキストと複製コンテキストは、以下の方法で区別できます：

source: You can do so by using https://github.com/quarkiverse[Quarkiverse] https://github.com/quarkiverse/quarkiverse-google-cloud-services[Google Cloud Services]. You need only to add the https://github.com/quarkiverse/quarkiverse-google-cloud-services/releases/latest[latest tag] service dependency as shown in the following example:
ja_jp: https://github.com/quarkiverse[Quarkiverse] https://github.com/quarkiverse/quarkiverse-google-cloud-services[Google クラウドサービス] を使用して、これを行うことができます。 追加する必要があるのは、 以下の例に示すように、 https://github.com/quarkiverse/quarkiverse-google-cloud-services/releases/latest[最新タグ] サービス依存関係のみです。

source: You can do this by requesting a token refresh with a refresh token. However, if the refresh token is unavailable, you can revoke the current access token first and then request a new access token.
ja_jp: リフレッシュトークンを使ってトークンをリフレッシュすることで、これを行うことができます。ただし、リフレッシュトークンが利用できない場合は、まず現在のアクセストークンを取り消してから、新しいアクセストークンを要求できます。

source: You can do this via the following `docker-compose.yml` file that you can launch via `docker-compose up -d`:
ja_jp: これは、以下の `docker-compose.yml` ファイルから、 `docker-compose up -d` で起動できます:

source: You can do this with `io.quarkus.test.common.DevServicesContext`, which can be injected directly into any `@QuarkusTest` or `@QuarkusIntegrationTest`. All you need to do is define a field of type `DevServicesContext` and it will be automatically injected. Using this you can retrieve any properties that have been set. Generally this is used to directly connect to a resource from the test itself, e.g. to connect to kafka to send messages to the application under test.
ja_jp: これは、 `@QuarkusTest` または `@QuarkusIntegrationTest` に直接注入できる `io.quarkus.test.common.DevServicesContext` を使用して行うことができます。タイプ `DevServicesContext` のフィールドを定義するだけで、自動的に注入されます。これを使用して、設定されている任意のプロパティーを取得できます。通常、これは、テスト自体からリソースに直接接続するために使用されます。たとえば、kafka に接続して、テスト対象のアプリケーションにメッセージを送信するために使用されます。

source: You can download it via Maven using the following command:
ja_jp: 以下のコマンドで Maven 経由でダウンロードできます。

source: You can drag a page from an extension card into the menu to *bookmark* it for quick access.
ja_jp: エクステンションカードからメニューにページをドラッグして、すばやくアクセスできるように *ブックマーク* できます。

source: You can easily filter all registered beans via the convenient `BeanStream` returned from the `ValidationPhaseBuildItem.getContext().beans()` method.
ja_jp: `ValidationPhaseBuildItem.getContext().beans()` メソッドから返される便利な `BeanStream` を使用して、登録されているすべての Bean を簡単にフィルタリングできます。

source: You can easily mock an HTTP Server with Wiremock. The xref:rest-client.adoc#using-a-mock-http-server-for-tests[Wiremock section of the Quarkus - Using the REST Client] describes how to set it up in detail.
ja_jp: Wiremock を使用して HTTP サーバーを簡単にモックできます。xref:rest-client.adoc#using-a-mock-http-server-for-tests[Wiremock section of the Quarkus - Using the REST Client] では、セットアップ方法について詳しく説明しています。

source: You can either add Observability extension dependency along with needed Dev Resources dependencies, or you use existing `sinks` - pom.xml files which add Observability extension dependency along with other required dependencies for certain technology stacks; e.g. `victoriametrics` sink would have `quarkus-observability-devresource-victoriametrics` and `quarkus-victoriametrics-client` dependencies already included in the `pom.xml`.
ja_jp: 必要な Dev Resource の依存関係とともに Observability エクステンションの依存関係を追加するか、既存の `sinks` - pom.xml ファイルを使用して、特定のテクノロジースタックに必要な他の依存関係とともに Observability エクステンションの依存関係を追加することができます。たとえば、 `victoriametrics` シンクには、 `pom.xml` にすでに含まれている `quarkus-observability-devresource-victoriametrics` および `quarkus-victoriametrics-client` 依存関係があります。

source: You can either create a new Maven project with the `oidc` extension or you can add the extension to an existing Maven project. Complete one of the following commands:
ja_jp: `oidc` エクステンションを使用して新しい Maven プロジェクトを作成することも、既存の Maven プロジェクトにエクステンションを追加することもできます。 次のいずれかのコマンドを実行します。

source: You can either explicitly enable xDS or you use `xds` name resolver, and make sure you point it to the right xDS server port (default is 9000). If you want to use `XdsChannelCredentials` set `xds.secure` to `true`.
ja_jp: xDSを明示的に有効にするか、 `xds` ネームリゾルバを使用し、正しいxDSサーバーポート（デフォルトは9000）を指定することを確認してください。もし、 `XdsChannelCredentials` を使用したい場合は、 `xds.secure` を `true` にセットしてください。

source: You can either use standard Javadoc comments or Asciidoc directly as a Javadoc comment.
ja_jp: 標準のJavadocコメントかAsciidocを直接Javadocコメントとして使うことができます。

source: You can enable AWS request signing in Hibernate Search by adding a dedicated extension to your project and configuring it.
ja_jp: Hibernate SearchでAWSリクエストの署名を有効にするには、専用のエクステンションをプロジェクトに追加して設定します。

source: You can enable PAR for your OIDC web-app endpoint by setting the `quarkus.oidc.authentication.par.enabled` configuration property to `true`. It will be enabled automatically if the OIDC metadata contains a `require_pushed_authorization_requests` property that is set to `true`.
ja_jp: `quarkus.oidc.authentication.par.enabled` 設定プロパティーを `true` に設定することで、OIDC web-app エンドポイントの PAR を有効にできます。OIDC メタデータに `require_pushed_authorization_requests` プロパティーが `true` に設定されている場合、自動的に有効になります。

source: You can enable PKCE for your OIDC web-app endpoint with a `quarkus.oidc.authentication.pkce-required` property and a 32-character secret that is required to encrypt the PKCE code verifier in the state cookie, as shown in the following example:
ja_jp: 次の例に示すように、 `quarkus.oidc.authentication.pkce-required` プロパティーと、状態クッキーの PKCE コード検証を暗号化するために必要な 32 文字のシークレットを使用して、OIDC web-app エンドポイントの PKCE を有効にすることができます。

source: You can enable _basic_ authentication using the following properties:
ja_jp: _Basic_ 認証は、以下のプロパティを使用して有効にすることができます:

source: You can enable `PKCE` for your OIDC `web-app` endpoint with a `quarkus.oidc.authentication.pkce-required` property and a 32 characters long secret, for example:
ja_jp: OIDC の `web-app` エンドポイントで `PKCE` を有効にするには、例えば `quarkus.oidc.authentication.pkce-required` プロパティーと 32 文字の長さのシークレットを指定することができます。

source: You can enable an extension using:
ja_jp: 以下を使ってエクステンションを有効化できます。

source: You can enable optimistic locking using:
ja_jp: 以下を使用して、楽観的なロックを有効にすることができます:

source: You can enable sending log entries from all appenders to OpenTelemetry Logging.
ja_jp: すべてのアペンダーから OpenTelemetry Logging へのログエントリ送信を有効にできます。

source: You can enable the Micrometer Virtual Thread _binder_ by adding the following artifact to your application:
ja_jp: アプリケーションに次のアーティファクトを追加することで、Micrometer 仮想スレッド _バインダー_ を有効化できます。

source: You can enable this strategy by configured enabled-auto-commit to true:
ja_jp: enabled-auto-commitをtrueに設定することで、このストラテジーを有効にすることができます:

source: You can encrypt claims immediately or after setting the `JSON Web Encryption (JWE)` headers, similar to how claims are signed. However, encrypting claims always requires a `jwe()` transition to a `JwtEncryptionBuilder` because the API is optimized to support signing and inner-signing operations.
ja_jp: クレームは、署名方法と同様に、すぐに暗号化することも、 `JSON Web Encryption (JWE)` ヘッダーを設定した後に暗号化することもできます。 ただし、API は署名および内部署名操作をサポートするように最適化されているため、クレームを暗号化するには、常に `jwe()` から `JwtEncryptionBuilder` への遷移が必要です。

source: You can enforce both Role Based and Permission Based Access Controls in Quarkus by combining `@RolesAllowed` and `@PermissionsAllowed` annotations.
ja_jp: `@RolesAllowed` アノテーションと `@PermissionsAllowed` アノテーションを組み合わせることで、Quarkus でロールベースおよび権限ベースのアクセス制御を適用できます。

source: You can enforce that only a single authentication mechanism is selected for a given request path, for example:
ja_jp: 特定の要求パスに対して単一の認証メカニズムのみが選択されるように強制できます。以下に例を示します。

source: You can experiment with the default cache implementation or register a custom one.
ja_jp: デフォルトのキャッシュ実装を試すことも、カスタムのキャッシュ実装を登録することもできます。

source: You can explicitly disable the binder by setting the following property in your `application.properties`:
ja_jp: `application.properties` で次のプロパティーを設定することで、バインダーを明示的に無効化できます。

source: You can explicitly disable the plain HTTP protocol, thus requiring all requests to use HTTPS. When you set `quarkus.http.ssl.client-auth` to `required`, the system automatically sets `quarkus.http.insecure-requests` to `disabled`.
ja_jp: プレーン HTTP プロトコルを明示的に無効にすることで、すべてのリクエストで HTTPS を使用するよう要求することができます。 `quarkus.http.ssl.client-auth` を `required` に設定すると、システムは自動的に `quarkus.http.insecure-requests` を `disabled` に設定します。

source: You can expose a bean implementing the `io.quarkus.redis.client.RedisOptionsCustomizer` interface to customize the Redis client options. The bean is called for each configured Redis client:
ja_jp: Redis クライアントのオプションをカスタマイズするために、 `io.quarkus.redis.client.RedisOptionsCustomizer` インターフェイスを実装した Bean を公開することができます。この Bean は、設定された各 Redis クライアントに対して呼び出されます。
